nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8200/common/pin_mux/pin_mux.h
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define GPIO_PUR_PU_2_MASK 0x04u   /*!<@brief Pull Resistor Enable Bits Mask for item 2. */
#define GPIO_PUR_PU_8_MASK 0x0100u /*!<@brief Pull Resistor Enable Bits Mask for item 8. */
#define PUR_PU_2_DISABLED 0x00u    /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */
#define PUR_PU_8_DISABLED 0x00u    /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */

/*! @name GPIOC2 (number 5), J4[1]/J9[2]/J502[12]/J500A[B62]/TXD0
  @{ */
#define BOARD_BUTTON_SW1_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_BUTTON_SW1_PIN 2U              /*!<@brief GPIOC pin index: 2 */
#define BOARD_BUTTON_SW1_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name GPIOF8 (number 6), J5[1]/J502[13]/J500A[B61]/J8[2]/RXD0
  @{ */
#define BOARD_BUTTON_SW2_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_BUTTON_SW2_PIN 8U              /*!<@brief GPIOF pin index: 8 */
#define BOARD_BUTTON_SW2_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

/*! @name GPIOE0 (number 45), U500A[1]/J501[11]/J500A[A39]/PWM0B
  @{ */
#define BOARD_LED_0_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_0_PIN 0U              /*!<@brief GPIOE pin index: 0 */
#define BOARD_LED_0_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOE1 (number 46), U500B[3]/J501[9]/J500A[A40]/PWM0A
  @{ */
#define BOARD_LED_1_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_1_PIN 1U              /*!<@brief GPIOE pin index: 1 */
#define BOARD_LED_1_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOE2 (number 47), U500C[5]/J501[32]/J500A[A37]/PWM1B
  @{ */
#define BOARD_LED_2_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_2_PIN 2U              /*!<@brief GPIOE pin index: 2 */
#define BOARD_LED_2_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOE3 (number 48), U500D[9]/J501[30]/J500A[A38]/PWM1A
  @{ */
#define BOARD_LED_3_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_3_PIN 3U              /*!<@brief GPIOE pin index: 3 */
#define BOARD_LED_3_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOE4 (number 51), U500E[11]/J501[36]/J500A[B39]/PWM2B
  @{ */
#define BOARD_LED_4_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_4_PIN 4U              /*!<@brief GPIOE pin index: 4 */
#define BOARD_LED_4_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOE5 (number 52), U500F[13]/J501[34]/J500A[B40]/PWM2A
  @{ */
#define BOARD_LED_5_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_5_PIN 5U              /*!<@brief GPIOE pin index: 5 */
#define BOARD_LED_5_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOE6 (number 53), U502D[9]/J501[28]/J500A[B37]/PWM3B
  @{ */
#define BOARD_LED_6_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_6_PIN 6U              /*!<@brief GPIOE pin index: 6 */
#define BOARD_LED_6_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOE7 (number 54), U502E[11]/J501[26]/J500A[B38]/PWM3A
  @{ */
#define BOARD_LED_7_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_7_PIN 7U              /*!<@brief GPIOE pin index: 7 */
#define BOARD_LED_7_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOF6 (number 58), J4[3]/J502[9]/U502F[13]/J500A[A59]
  @{ */
#define BOARD_LED_8_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_8_PIN 6U              /*!<@brief GPIOF pin index: 6 */
#define BOARD_LED_8_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*! @name GPIOA4 (number 12), J23[2]/J501[38]/J500A[A9]/ANA4
  @{ */
#define BOARD_THM0P_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THM0P_PIN 4U              /*!<@brief GPIOA pin index: 4 */
#define BOARD_THM0P_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOA5 (number 11), J23[4]/J501[40]/J500A[A10]/ANA5
  @{ */
#define BOARD_THM0N_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THM0N_PIN 5U              /*!<@brief GPIOA pin index: 5 */
#define BOARD_THM0N_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOA7 (number 9), J19[4]/J502[4]/J500A[A35]/ANA7
  @{ */
#define BOARD_THM1N_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THM1N_PIN 7U              /*!<@brief GPIOA pin index: 7 */
#define BOARD_THM1N_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOA6 (number 10), J19[2]/J502[2]/J500A[A11]/ANA6
  @{ */
#define BOARD_THM1P_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THM1P_PIN 6U              /*!<@brief GPIOA pin index: 6 */
#define BOARD_THM1P_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOB7 (number 17), J2[4]/J500A[B35]/J501[2]/ANB7
  @{ */
#define BOARD_THM3N_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_THM3N_PIN 7U              /*!<@brief GPIOB pin index: 7 */
#define BOARD_THM3N_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOB6 (number 19), J2[2]/J501[39]/J500A[B23]/ANB6
  @{ */
#define BOARD_THM3P_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_THM3P_PIN 6U              /*!<@brief GPIOB pin index: 6 */
#define BOARD_THM3P_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOB5 (number 20), J1[4]/J501[37]/J500A[B22]/ANB5
  @{ */
#define BOARD_THM2N_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_THM2N_PIN 5U              /*!<@brief GPIOB pin index: 5 */
#define BOARD_THM2N_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOB4 (number 21), J1[2]/J501[35]/J500A[B21]/ANB4
  @{ */
#define BOARD_THM2P_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_THM2P_PIN 4U              /*!<@brief GPIOB pin index: 4 */
#define BOARD_THM2P_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTHERMISTORPins(void);

/*! @name GPIOC11 (number 37), J502[15]/J16[1]/J500A[B42]/CANTX
  @{ */
#define BOARD_CANTX_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_CANTX_PIN 11U              /*!<@brief GPIOC pin index: 11 */
#define BOARD_CANTX_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name GPIOC12 (number 38), J502[17]/J16[3]/J500A[B41]/CANRX
  @{ */
#define BOARD_CANRX_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_CANRX_PIN 12U              /*!<@brief GPIOC pin index: 12 */
#define BOARD_CANRX_PIN_MASK kGPIO_Pin12 /*!<@brief PORT pin mask */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

#define GPIO_PUR_PU_14_MASK 0x4000u /*!<@brief Pull Resistor Enable Bits Mask for item 14. */
#define GPIO_PUR_PU_15_MASK 0x8000u /*!<@brief Pull Resistor Enable Bits Mask for item 15. */
#define PUR_PU_14_ENABLED 0x4000u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */
#define PUR_PU_15_ENABLED 0x8000u   /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
